# Decision Trees Date-16-8-22

In [1]:
import pandas as pd
df=pd.read_csv("tree.csv")
df

      company                 job     degree  salary more than 100k
0      google     sales executive  bachelors                      0
1      google     sales executive    masters                      0
2      google    business manager  bachelors                      1
3      google    business manager    masters                      1
4      google  computer programer  bachelors                      0
5      google  computer programer    masters                      1
6   microsoft     sales executive    masters                      0
7   microsoft  computer programer  bachelors                      0
8   microsoft    business manager  bachelors                      0
9   microsoft    business manager    masters                      1
10   facebook     sales executive  bachelors                      1
11   facebook     sales executive    masters                      1
12   facebook    business manager  bachelors                      1
13   facebook    business manager    masters                      1
14   facebook  computer programer  bachelors                      1
15   facebook  computer programer    masters                      1

In [2]:
df.head()

  company                 job     degree  salary more than 100k
0  google     sales executive  bachelors                      0
1  google     sales executive    masters                      0
2  google    business manager  bachelors                      1
3  google    business manager    masters                      1
4  google  computer programer  bachelors                      0

In [3]:
#inputs haa a dependent variable and targets has independent variables
inputs=df.drop('salary more than 100k',axis='columns')
target=df['salary more than 100k']

In [4]:
target

0     0
1     0
2     1
3     1
4     0
5     1
6     0
7     0
8     0
9     1
10    1
11    1
12    1
13    1
14    1
15    1
Name: salary more than 100k, dtype: int64

In [5]:
#change the catgorial data to numerical data
from sklearn .preprocessing import LabelEncoder

In [6]:
le_company=LabelEncoder()
le_job=LabelEncoder()
le_degree=LabelEncoder()

In [7]:
inputs['company_n']=le_company.fit_transform(inputs['company'])
inputs['job_n']=le_job.fit_transform(inputs['job'])
inputs['degree_n']=le_degree.fit_transform(inputs['degree'])
inputs.head()

  company                 job     degree  company_n  job_n  degree_n
0  google     sales executive  bachelors          1      2         0
1  google     sales executive    masters          1      2         1
2  google    business manager  bachelors          1      0         0
3  google    business manager    masters          1      0         1
4  google  computer programer  bachelors          1      1         0

In [8]:
inputs_n=inputs.drop(['company','job','degree'],axis='columns')
inputs_n

    company_n  job_n  degree_n
0           1      2         0
1           1      2         1
2           1      0         0
3           1      0         1
4           1      1         0
5           1      1         1
6           2      2         1
7           2      1         0
8           2      0         0
9           2      0         1
10          0      2         0
11          0      2         1
12          0      0         0
13          0      0         1
14          0      1         0
15          0      1         1

In [9]:
from sklearn import tree

In [10]:
model=tree.DecisionTreeClassifier()

In [11]:
model.fit(inputs_n,target)

DecisionTreeClassifier()

In [12]:
model.score(inputs_n,target)

1.0

In [13]:
#company,job and degree then gives salary is above 100k or not
model.predict([[2,2,1]])

array([0], dtype=int64)

In [14]:
model.predict([[0,0,0]])

array([1], dtype=int64)